app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `atividade`
WHERE `fk_usuario_id_usuario` = '2'
SELECT SUM(`quantidade_calorias`) AS `quantidade_calorias`
FROM `atividade`
WHERE `fk_usuario_id_usuario` = '2'
SELECT COUNT(*) AS `numrows`
FROM `atividade`
SELECT SUM(`quantidade_calorias`) AS `quantidade_calorias`
FROM `atividade`
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `atividade`
JOIN `usuario` ON `usuario`.`id_usuario` = `atividade`.`fk_usuario_id_usuario`
SELECT `atividade`.*, `usuario`.`nome_usuario`, `usuario`.`imagem`
FROM `atividade`
JOIN `usuario` ON `usuario`.`id_usuario` = `atividade`.`fk_usuario_id_usuario`
ORDER BY `atividade`.`createdAt` DESC
 LIMIT 4
---
    public function index()
    {
        $model = new AtividadeModel();
        $db = Database::connect();

        $tipo = $this->request->getGet('tipo');
        $session = session();
        $userId = $session->get('id_usuario');

        // Determina os contadores da Sidebar baseado no estado do login
        if ($userId) {
            // Se o usuário estiver logado, exibe os dados específicos dele
            $dados['totalAtividades'] = $db->table('atividade')->where('fk_usuario_id_usuario', $userId)->countAllResults();
            $sum = $db->table('atividade')->selectSum('quantidade_calorias')->where('fk_usuario_id_usuario', $userId)->get()->getRowArray();
            $dados['totalCalorias'] = $sum['quantidade_calorias'] ?? 0;
        } else {
            // Se não houver login, exibe os totais globais do sistema
            $dados['totalAtividades'] = $model->countAllResults();
            $total = $model->selectSum('quantidade_calorias')->first();
            $dados['totalCalorias'] = $total['quantidade_calorias'] ?? 0;
        }

        // Criação da Query principal trazendo os posts unidos aos dados dos respectivos autores
        $builder = $model->select('atividade.*, usuario.nome_usuario, usuario.imagem')
                         ->join('usuario', 'usuario.id_usuario = atividade.fk_usuario_id_usuario');

        if (!empty($tipo)) {
            $builder = $builder->where('LOWER(atividade.tipo_atividade)', strtolower($tipo));
        }

        $atividades = $builder->orderBy('atividade.createdAt', 'DESC')->paginate(4);

SELECT COUNT(*) AS `numrows`
FROM `curtida_curtida`
WHERE `fk_atividade_id_atividade` = '14'
SELECT COUNT(*) AS `numrows`
FROM `comentario_comentario`
WHERE `fk_atividade_id_atividade` = '14'
SELECT COUNT(*) AS `numrows`
FROM `curtida_curtida`
WHERE `fk_atividade_id_atividade` = '14'
AND `fk_usuario_id_usuario` = '2'
---
        foreach ($atividades as &$a) {
            $atividadeId = $a['id_atividade'];

            $a['likes'] = (int) $db->table('curtida_curtida')->where('fk_atividade_id_atividade', $atividadeId)->countAllResults();
            $a['comments'] = (int) $db->table('comentario_comentario')->where('fk_atividade_id_atividade', $atividadeId)->countAllResults();

            $a['liked_by_user'] = false;
            if ($userId) {
                $a['liked_by_user'] = $db->table('curtida_curtida')
                    ->where('fk_atividade_id_atividade', $atividadeId)
                    ->where('fk_usuario_id_usuario', $userId)
                    ->countAllResults() > 0;

SELECT *
FROM `usuario`
WHERE `email` = 'usuario1@email.com'
AND `senha` = '123456'
---
    public function login()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(403);
        }

        $email = $this->request->getPost('email');
        $senha = $this->request->getPost('senha');

        if (empty($email) || empty($senha)) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Por favor, preencha todos os campos.'
            ]);
        }

        $db = Database::connect();
        $usuario = $db->table('usuario')
                      ->where('email', $email)
                      ->where('senha', $senha)
                      ->get()
                      ->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `curtida_curtida`
WHERE `fk_atividade_id_atividade` = '14'
AND `fk_usuario_id_usuario` = '2'
DELETE FROM `curtida_curtida`
WHERE `fk_atividade_id_atividade` = '14'
AND `fk_usuario_id_usuario` = '2'
INSERT INTO `curtida_curtida` (`fk_atividade_id_atividade`, `fk_usuario_id_usuario`) VALUES ('14', '2')
---
    public function toggleLike()
    {
        $session = session();
        $userId = $session->get('id_usuario');

        if (!$userId) {
            return $this->response->setJSON(['success' => false, 'message' => 'Você precisa estar logado para curtir.']);
        }

        $atividadeId = $this->request->getPost('id_atividade');
        if (!$atividadeId) {
            return $this->response->setJSON(['success' => false, 'message' => 'Atividade inválida.']);
        }

        $db = Database::connect();
        $tabelaCurtidas = $db->table('curtida_curtida');

        $jaCurtiu = $tabelaCurtidas->where('fk_atividade_id_atividade', $atividadeId)
                                   ->where('fk_usuario_id_usuario', $userId)
                                   ->countAllResults() > 0;

        if ($jaCurtiu) {
            $tabelaCurtidas->where('fk_atividade_id_atividade', $atividadeId)
                           ->where('fk_usuario_id_usuario', $userId)
                           ->delete();
            $acao = 'removido';
        } else {
            $tabelaCurtidas->insert([
                'fk_atividade_id_atividade' => $atividadeId,
                'fk_usuario_id_usuario'     => $userId
            ]);