app/Models/UsuarioModel.php

    public function buscarPorEmail(string $email)
    {
        return $this->asArray()->where('email', $email)->first();
---
SELECT *
FROM `usuario`
WHERE `email` = '0001137159@senaimgaluno.com.br'
 LIMIT 1